#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет выплаты по остаткам задолженности перед сотрудниками на дату документа.
//
Процедура ЗаполнитьПоОстаткам() Экспорт
	
	Выплаты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Взаиморасчеты.Сотрудник КАК Сотрудник,
	|	Взаиморасчеты.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&МоментВремени, ) КАК Взаиморасчеты
	|ГДЕ
	|	Взаиморасчеты.СуммаОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Взаиморасчеты.Сотрудник.Наименование";
	Запрос.УстановитьПараметр("МоментВремени",
		?(ЗначениеЗаполнено(Ссылка), Новый Граница(МоментВремени(), ВидГраницы.Исключая), КонецДня(Дата)));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Выплаты.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого Строка Из Выплаты Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Сумма = Строка.Сумма;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
