#Область СлужебныйПрограммныйИнтерфейс

// Добавляет поставляемые профили групп доступа подсистем ВКМ.
// Вызывается из УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа.
//
// Параметры:
//  ОписанияПрофилей - Массив из см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей) Экспорт
	
	// Специалист
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Специалист";
	ОписаниеПрофиля.Идентификатор = "1c0bc26a-d168-48ae-a7e3-40317064c744";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Специалист'", ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Выполняет работы по заявкам клиентов, заполняет выполненные работы
		|и прикладывает лист учета рабочего времени к документу Обслуживание клиента.'");
	ДобавитьОбщиеРоли(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ВКМ_ДобавлениеИзменениеОбслуживанийКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ВКМ_ОтчетВыработкаСпециалистов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Менеджер
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Менеджер";
	ОписаниеПрофиля.Идентификатор = "c5b13e3e-94a7-4f1d-940b-d537ff822cb6";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер'", ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Принимает заявки клиентов и планирует обслуживание специалистами.'");
	ДобавитьОбщиеРоли(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ВКМ_ДобавлениеИзменениеОбслуживанийКлиентов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Бухгалтер IT-фирмы
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "БухгалтерИТФирмы";
	ОписаниеПрофиля.Идентификатор = "d75a8226-7b53-4f4a-bfc3-768333ba6872";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Бухгалтер IT-фирмы'", ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Выставляет клиентам акты по абонентским договорам,
		|в том числе массово в начале месяца.'");
	ДобавитьОбщиеРоли(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПродажи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВзаиморасчетовСПокупателями");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	ОписаниеПрофиля.Роли.Добавить("ВКМ_МассовоеСозданиеАктов");
	ОписаниеПрофиля.Роли.Добавить("ВКМ_ОтчетАнализВыставленныхАктов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Кадровик-расчетчик
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "КадровикРасчетчик";
	ОписаниеПрофиля.Идентификатор = "22898dfb-be23-419f-9d67-4c7596b377df";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Кадровик-расчетчик'", ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Ведет сотрудников и условия оплаты, планирует отпуска,
		|начисляет и выплачивает управленческую зарплату.'");
	ДобавитьОбщиеРоли(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ВКМ_РасчетЗарплаты");
	ОписаниеПрофиля.Роли.Добавить("ВКМ_ОтчетВыработкаСпециалистов");
	ОписаниеПрофиля.Роли.Добавить("ВКМ_ОтчетыПоЗарплате");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьОбщиеРоли(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазоваяФункциональностьТП");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНСИ");
	
КонецПроцедуры

#КонецОбласти
