#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Пересчитывает календарные дни отпусков и признак превышения лимита 28 дней
// (по сумме всех отпусков сотрудника в графике).
//
// Параметры:
//  ОтпускаСотрудников - ТабличнаяЧасть, ДанныеФормыКоллекция - строки отпусков.
//
Процедура ПересчитатьДниОтпусков(ОтпускаСотрудников) Экспорт
	
	ВКМ_РасчетЗарплатыКлиентСервер.ПересчитатьДниОтпусков(ОтпускаСотрудников);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
