#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Год) Тогда
		Год = Год(ТекущаяДатаСеанса()) + 1;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ВКМ_ГрафикОтпусков.ПересчитатьДниОтпусков(ОтпускаСотрудников);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НачалоГода = Дата(Год, 1, 1);
	КонецГода = КонецГода(НачалоГода);
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		Если Строка.ДатаОкончания < Строка.ДатаНачала Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Строка %1: дата окончания отпуска раньше даты начала.'"), Строка.НомерСтроки),
				ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОтпускаСотрудников", Строка.НомерСтроки, "ДатаОкончания"),
				, Отказ);
		ИначеЕсли Строка.ДатаНачала < НачалоГода Или Строка.ДатаОкончания > КонецГода Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Строка %1: отпуск должен входить в %2 год.'"), Строка.НомерСтроки, Формат(Год, "ЧГ=0")),
				ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОтпускаСотрудников", Строка.НомерСтроки, "ДатаНачала"),
				, Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ЗапланированныеОтпуска.Записывать = Истина;
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ЗапланированныеОтпуска.Добавить();
		Движение.Период = Строка.ДатаНачала;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ДатаНачала = Строка.ДатаНачала;
		Движение.ДатаОкончания = Строка.ДатаОкончания;
		Движение.Дней = Строка.ДнейОтпуска;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
