#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Возврат;
	КонецЕсли;
	
	ПроверяемыеРеквизиты.Добавить("ВКМ_ДатаНачала");
	ПроверяемыеРеквизиты.Добавить("ВКМ_ДатаОкончания");
	ПроверяемыеРеквизиты.Добавить("ВКМ_СтоимостьЧасаРаботы");
	
	Если ЗначениеЗаполнено(ВКМ_ДатаНачала) И ЗначениеЗаполнено(ВКМ_ДатаОкончания)
		И ВКМ_ДатаОкончания < ВКМ_ДатаНачала Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Дата окончания действия договора не может быть раньше даты начала.'"),
			ЭтотОбъект, "ВКМ_ДатаОкончания", "Объект", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
