#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки
//   НастройкиОтчета - см. ВариантыОтчетов.ОписаниеОтчета
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ВКМ_РасходЗапланированныхОтпусков, "Основной");
	НастройкиВарианта.Описание = НСтр("ru = 'Расход запланированных отпусков'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
